results/out/aleph-epoll.ring-interceptors.async.java17.ShenandoahGC.r30k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.336ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.348ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.278ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.321ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.396ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.326ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.231ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.342ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.377ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.427ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.222ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms    1.37ms 119.62ms   96.03%
    Req/Sec     1.98k   471.92     7.11k    75.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.57ms
 90.000%    2.09ms
 99.000%    5.56ms
 99.900%   16.77ms
 99.990%   42.46ms
 99.999%   83.26ms
100.000%  119.68ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.077     0.000000            1         1.00
       0.465     0.100000      1769820         1.11
       0.660     0.200000      3547883         1.25
       0.825     0.300000      5314677         1.43
       0.978     0.400000      7088955         1.67
       1.126     0.500000      8852117         2.00
       1.201     0.550000      9735640         2.22
       1.280     0.600000     10624101         2.50
       1.365     0.650000     11507068         2.86
       1.460     0.700000     12393892         3.33
       1.568     0.750000     13276254         4.00
       1.629     0.775000     13718555         4.44
       1.696     0.800000     14160274         5.00
       1.770     0.825000     14599989         5.71
       1.855     0.850000     15041836         6.67
       1.957     0.875000     15486646         8.00
       2.016     0.887500     15705859         8.89
       2.085     0.900000     15931220        10.00
       2.163     0.912500     16151141        11.43
       2.255     0.925000     16369593        13.33
       2.369     0.937500     16590682        16.00
       2.437     0.943750     16701190        17.78
       2.517     0.950000     16814006        20.00
       2.607     0.956250     16922883        22.86
       2.719     0.962500     17034268        26.67
       2.861     0.968750     17143799        32.00
       2.953     0.971875     17198918        35.56
       3.069     0.975000     17254344        40.00
       3.219     0.978125     17309153        45.71
       3.439     0.981250     17364624        53.33
       3.825     0.984375     17419886        64.00
       4.151     0.985938     17447430        71.11
       4.607     0.987500     17475033        80.00
       5.191     0.989062     17502789        91.43
       5.839     0.990625     17530342       106.67
       6.647     0.992188     17557957       128.00
       7.127     0.992969     17571792       142.22
       7.659     0.993750     17585649       160.00
       8.239     0.994531     17599422       182.86
       8.919     0.995313     17613304       213.33
       9.831     0.996094     17627169       256.00
      10.367     0.996484     17633988       284.44
      10.935     0.996875     17640898       320.00
      11.503     0.997266     17647844       365.71
      12.159     0.997656     17654753       426.67
      13.063     0.998047     17661665       512.00
      13.623     0.998242     17665120       568.89
      14.247     0.998437     17668566       640.00
      14.991     0.998633     17672034       731.43
      15.879     0.998828     17675477       853.33
      16.911     0.999023     17678937      1024.00
      17.503     0.999121     17680651      1137.78
      18.191     0.999219     17682360      1280.00
      19.087     0.999316     17684090      1462.86
      20.223     0.999414     17685821      1706.67
      21.791     0.999512     17687561      2048.00
      22.751     0.999561     17688420      2275.56
      24.063     0.999609     17689281      2560.00
      25.503     0.999658     17690147      2925.71
      27.327     0.999707     17691006      3413.33
      29.759     0.999756     17691868      4096.00
      31.183     0.999780     17692297      4551.11
      32.863     0.999805     17692733      5120.00
      34.655     0.999829     17693169      5851.43
      36.735     0.999854     17693595      6826.67
      39.135     0.999878     17694028      8192.00
      40.799     0.999890     17694242      9102.22
      42.847     0.999902     17694457     10240.00
      45.407     0.999915     17694676     11702.86
      48.095     0.999927     17694894     13653.33
      51.487     0.999939     17695105     16384.00
      53.023     0.999945     17695213     18204.44
      55.071     0.999951     17695323     20480.00
      57.311     0.999957     17695429     23405.71
      60.127     0.999963     17695537     27306.67
      63.583     0.999969     17695645     32768.00
      65.215     0.999973     17695701     36408.89
      67.455     0.999976     17695753     40960.00
      70.655     0.999979     17695808     46811.43
      73.791     0.999982     17695861     54613.33
      76.735     0.999985     17695915     65536.00
      78.143     0.999986     17695943     72817.78
      80.511     0.999988     17695969     81920.00
      82.623     0.999989     17695996     93622.86
      84.863     0.999991     17696023    109226.67
      87.807     0.999992     17696051    131072.00
      89.151     0.999993     17696064    145635.56
      90.111     0.999994     17696077    163840.00
      91.391     0.999995     17696091    187245.71
      93.055     0.999995     17696105    218453.33
      94.911     0.999996     17696118    262144.00
      96.319     0.999997     17696125    291271.11
      97.855     0.999997     17696131    327680.00
      99.647     0.999997     17696138    374491.43
     101.055     0.999998     17696145    436906.67
     102.079     0.999998     17696152    524288.00
     104.191     0.999998     17696155    582542.22
     105.023     0.999998     17696158    655360.00
     105.471     0.999999     17696162    748982.86
     106.495     0.999999     17696165    873813.33
     107.327     0.999999     17696169   1048576.00
     107.391     0.999999     17696170   1165084.44
     109.567     0.999999     17696172   1310720.00
     110.911     0.999999     17696174   1497965.71
     111.423     0.999999     17696175   1747626.67
     112.191     1.000000     17696177   2097152.00
     112.575     1.000000     17696178   2330168.89
     113.343     1.000000     17696179   2621440.00
     115.839     1.000000     17696180   2995931.43
     115.839     1.000000     17696180   3495253.33
     116.479     1.000000     17696181   4194304.00
     118.271     1.000000     17696182   4660337.78
     118.271     1.000000     17696182   5242880.00
     118.463     1.000000     17696183   5991862.86
     118.463     1.000000     17696183   6990506.67
     118.463     1.000000     17696183   8388608.00
     118.591     1.000000     17696184   9320675.55
     118.591     1.000000     17696184  10485760.00
     118.591     1.000000     17696184  11983725.71
     118.591     1.000000     17696184  13981013.34
     118.591     1.000000     17696184  16777216.00
     119.679     1.000000     17696185  18641351.10
     119.679     1.000000     17696185          inf
#[Mean    =        1.307, StdDeviation   =        1.368]
#[Max     =      119.616, Total count    =     17696185]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17994696 requests in 10.00m, 3.00GB read
Requests/sec:  29991.18
Transfer/sec:      5.12MB